res={};
res.gUrl="/sp2/act/inter.info.action?wAgent=8848&wPassword=888888&wReturnFmt=2&";
res.lotts={
			"11":"足彩胜负彩","16":"半全场胜负彩","18":"四场进球彩","33":"体彩排列3",
			"35":"体彩排列5","51":"双色球","52":"福彩3D","10022":"七星彩","23508":"双色球红球",
			"23525":"体彩22选5","23526":"体彩31选7","23527":"泛珠三角36选7","23528":"七乐彩",
			"23529":"超级大乐透","23530":"生肖乐","20104":"北京两步彩（一步区）",
			"10201":"上海天天彩选4","10202":"时时乐","21304":"华东六省15选5",
			"10016":"天津体彩6+1","20303":"天津风采15选5","10019":"浙江体彩6+1",
			"21302":"浙江体彩20选5","21304":"华东六省15选5","23533":"浙江体彩31选7",
			"20701":"南粤风采26选5","20703":"南粤风采36选7","20704":"深圳风采35选7",
			"10013":"江苏体彩7位数","10014":"江苏体彩5+1","21304":"华东六省15选5","21407":"山东群英会",
			"21304":"华东六省15选5","22204":"福建体彩22选5","22205":"福建体彩31选7",
			"22206":"福建体彩36选7","21902":"辽宁风采35选7","21703":"燕赵风采20选5",
			"21603":"中原风采22选5","21401":"齐鲁风采23选5","21406":"11选5",
			"22003":"三晋风采21选5","22701":"楚天风采22选5","10010":"黑龙江体彩6+1",
			"10025":"黑龙江福彩P62","21502":"龙江风采22选5","21504":"龙江风采36选7",
			"21304":"华东六省15选5","22104":"安徽福彩25选5","13001":"新时时彩",
			"21304":"华东六省15选5","23507":"云贵川福彩22选5","10026":"海南体彩4+1",
			"22601":"新疆风采35选7","22602":"新疆风采18选7","22603":"新疆风采25选7","23531":"东方6+1",
			"23101":"湖南风采22选5","10401":"重庆时时彩","20108":"北京快乐8","20109":"北京PK拾" 
			
	}


//全国联动
res.fMenu = [
				"全国","北京","上海","天津","重庆","浙江","广东","江苏","福建","辽宁","河北","河南","山东",
				"山西","湖北","安徽","江西","四川","云南","贵州","海南","新疆","湖南","黑龙江"
			];
res.areaToId = {
				"北京":1,"上海":2,"天津":3,"重庆":4,"香港":5,"澳门":6,"广东":7,"广西":8,"江苏":9,
				"甘肃":10,"宁夏":11,"青海":12,"浙江":13,"山东":14,"黑龙江":15,"河南":16,"河北":17,
				"陕西":18,"辽宁":19,"山西":20,"安徽":21,"福建":22,"云南":23,"海南":24,"内蒙古":25,
				"新疆":26,"湖北":27,"四川":28,"贵州":29,"江西":30,"湖南":31,"吉林":32,"西藏":33,"台湾":34,"全国":35
};
res.fValue = [];
res.sMenu = [
				["双色球","福彩3D","七乐彩","超级大乐透","七星彩","足彩胜负彩","半全场胜负彩","四场进球彩","排列3","排列5","22选5","36选7"],
				["北京两步彩","北京快乐8","北京PK拾"],["上海天天彩选4","时时乐","华东六省15选5"],
				["天津体彩6+1","天津风采15选5"],["重庆时时彩"],["浙江体彩6+1","浙江体彩20选5","华东六省15选5","浙江体彩31选7"],
				["南粤风采26选5","南粤风采36选7","深圳风采35选7"],["江苏体彩7位数","江苏体彩5+1","华东六省15选5"],
				["华东六省15选5","福建体彩22选5","福建体彩31选7","福建体彩36选7"],["辽宁风采35选7"],["燕赵风采20选5"],
				["中原风采22选5"],["齐鲁风采23选5","11选5"],["三晋风采21选5"],["楚天风采22选5"],["华东六省15选5","安徽福彩25选5"],
				["江西时时彩","华东六省15选5"],["云贵川福彩22选5"],["云贵川福彩22选5"],["云贵川福彩22选5"],
				["海南体彩4+1"],["新疆风采35选7","新疆风采18选7","新疆风采25选7"],["湖南风采22选5"],
				["黑龙江体彩6+1","黑龙江福彩P62","龙江风采22选5","龙江风采36选7"]
			];
			
res.sValue = [
				[51,52,23528,23529,10022,11,16,18,33,35,23525,23527],
				[20104,20108,20109],[10201,10202,21304],[10016,20303],[10401],[10019,21302,21304,23533],
				[20701,20703,20704],[10013,10014,21304],[21304,22204,22205,22206],
				[21902],[21703],[21603],[21401,21406],[22003],[22701],
				[21304,22104],[13001,21304],[23507],[23507],
				[23507],[10026],[22601,22602,22603],[23101],[10010,10025,21502,21504]
			];			
			
var area  = {};
for (var i = 0; i<res.fMenu.length; i++){
	var name = res.fMenu[i];
	area[name]={};
	area[name].id = res.areaToId[name]
	area[name].lotteryNames = res.sMenu[i];
	area[name].lotteryIds = res.sValue[i];
}



res.fcId=[
			51,52,10025,10026,10201,10202,10401,13001,20104,20105,20303,20701,10401,20108,
			20703,20704,21304,21401,21407,21502,21504,21505,21603,21703,21705,21706,21902,
			22003,22104,22601,22602,22603,22604,22701,23006,23101,23507,23508,23528,23531,20109
			];
			
res.tcId=[
			33,35,10010,10014,10016,10022,20406,21302,21406,22204,22205,22206,
			23009,23105,23525,23526,23527,23529,23530,23533,23534,10019,10013
			];
res.zcId=[
			11,16,18,19
			];
			
			
			
a = {
	//福彩
	"001":{name:"双色球",		resultId:51,	href:"/ssq/"},
	"002":{name:"福彩3D",	resultId:52,	href:"/3d/"},
	"003":{name:"七乐彩",		resultId:23528,	href:"/lottery/qlc/"},
	"004":{name:"东方6+1",	resultId:23531,	href:"/lottery/df/"},
	"005":{name:"15选5",		resultId:21304,	href:"/lottery/155/"},
	
	"006":{name:"新时时彩",	autonym:"江西时时彩",		resultId:13001,		href:"/lottery/ssc/"},
	"007":{name:"上海时时乐",	resultId:10202,	href:"/lottery/ssl/"},
	"016":{name:"快乐8",		resultId:20108,	href:"/lottery/kl8/"},
	"017":{name:"PK10",		resultId:20109,	href:"/lottery/pk10/"},
	"018":{name:"老时时彩",	autonym:"重庆时时彩",		resultId:10401,		href:"/cqssc/"},
	"019":{name:"北京3D",	resultId:52,	href:"/lottery/bj3d/"},
	"020":{name:"山东群英会",	resultId:21407,	href:"/lottery/qyh/"},
	"024":{name:"快三",		resultId:23543,	href:"/lottery/ahk3/"},
	"025":{name:"快乐十分",	resultId:23545,	href:"/lottery/kl10/"},

	//体彩
	"104":{name:"广东11选5",	resultId:23544,		href:"/gd115/"},
	"105":{name:"11选5",		autonym:"黑龙江11选5",	resultId:21406,		href:"/lottery/hlj115/"},
	"106":{name:"新11选5",	autonym:"江西11选5",		resultId:23540,		href:"/lottery/jx115/"},	//江西多乐彩
	"107":{name:"老11选5",	autonym:"山东11选5",		resultId:21406,		href:"/lottery/sd115/"}, 	//11运夺金
	"108":{name:"排列三",		resultId:33,	href:"/lottery/p3/"},
	"109":{name:"排列五",		resultId:35,	href:"/lottery/p5/"},
	"110":{name:"七星彩",		resultId:10022,	href:"/lottery/qxc/"},
	"111":{name:"22选5"},
	"112":{name:"31选7"},
	"113":{name:"超级大乐透",	resultId:23529,	href:"/dlt/"},
	"114":{name:"生肖乐"},
	
	//传统足彩
	"115":{name:"六场半全场",	resultId:16,	href:"/sfc/bqc/"},
	"116":{name:"四场进球",	resultId:18,	href:"/sfc/jqc/"},
	"117":{name:"胜负彩14场",	resultId:11,	href:"/sfc/"},
	"118":{name:"胜负彩任九",	resultId:19,	href:"/sfc/r9/"},
	
	//单场
	"201":{name:"单场胜平负",		href:"/lottery/dc/"},
	"202":{name:"上下单双",		href:"/lottery/dcsxds/"},
	"203":{name:"总进球数",		href:"/lottery/dczjq/"},
	"204":{name:"半全场",			href:"/lottery/dcbqc/"},
	"205":{name:"单场比分",		href:"/lottery/dcbf/"},
	"206":{name:"下半场比分"},
	
	//竞彩篮球
	"306":{name:"竞彩篮球让分胜负",		href:"/lottery/lc/"},
	"307":{name:"竞彩篮球胜负",			href:"/lottery/lcsf/"},
	"308":{name:"竞彩篮球胜分差",			href:"/lottery/lcsfc/"},
	"309":{name:"竞彩篮球大小分差",		href:"/lottery/lcdxf/"},
	"316":{name:"竞彩篮球让分胜负单关",		href:"/lottery/lc/dg.shtml"},
	"317":{name:"竞彩篮球胜负单关",		href:"/lottery/lcsf/dg.shtml"},
	"318":{name:"竞彩篮球胜分差单关",		href:"/lottery/lcsfc/dg.shtml"},
	"319":{name:"竞彩篮球大小分差单关",		href:"/lottery/lcdxf/dg.shtml"},
	
	//竞彩足球
	"301":{name:"竞彩足球让球胜平负",		href:"/jc/jcrqspf/"},
	"302":{name:"竞彩足球比分",			href:"/jc/jcbf/"},
	"303":{name:"竞彩足球总进球数",		href:"/jc/jczjq/"},
	"304":{name:"竞彩足球半场胜平负",		href:"/jc/jcbqc/"},
	"305":{name:"竞彩足球混合过关",		href:"/jc/jchhgg/"},
	
	"311":{name:"竞彩足球胜平负单关",		href:"/jc/dg.shtml"},
	"312":{name:"竞彩足球比分单关",		href:"/jc/jcbf/dg.shtml"},
	"313":{name:"竞彩足球总进球数单关",		href:"/jc/jczjq/dg.shtml"},
	"314":{name:"竞彩足球半场胜平负单关",	href:"/jc/jcbqc/dg.shtml"},	
	
	"320":{name:"竞彩足球胜平负",			href:"/jc/"},
	"321":{name:"竞彩足球胜平负单关",		href:"/jc/dg.shtml"},
	
	"401":{name:"冠军竞猜"},
	"402":{name:"冠亚军竞"},
	"403":{name:"奥运-胜负过关"},
	"404":{name:"奥运-第一名过"}
}

var obj = {};

for (var key in res.lotts){
	obj[key] = {}
	obj[key].name = res.lotts[key];
}
//console.log(obj)
/*
for (var i=0; i< res.sValue.length; i++){
	var id = res.sValue[i];
	if (!obj[id]) obj[id]={};
	obj[id].name = res.sMenu[i];
}
*/


for (var key in a){
	if (a[key].resultId){
		if (!obj[a[key].resultId]) obj[a[key].resultId] = {}
		obj[a[key].resultId].name = obj[a[key].resultId].autonym || a[key].name;
		obj[a[key].resultId].tradeId = key;
		obj[a[key].resultId].tradeRouter = a[key].href;
	}
}
for (var key in obj){
	if (obj[key].tradeRouter) {
			
			obj[key].isTrade = true 
		}else{
			obj[key].isTrade = false 
		}
	if (res.fcId.indexOf(parseInt(key,10))!==-1) obj[key].lotteryType = 0;
	if (res.tcId.indexOf(parseInt(key,10))!==-1) obj[key].lotteryType = 1;
	if (res.zcId.indexOf(parseInt(key,10))!==-1) obj[key].lotteryType = 2;
}

//console.log(obj)

console.log(B.json(obj))

//console.log(obj)
