/**
 * @各个地区采种
 * 依赖 无
 * @author gaoliwei
 * 用法 id:省Id, lotteryNames:当地彩种, lotteryIds:采种id;
*/
define({
	"全国":{"id":35,"lotteryNames":["双色球","福彩3D","七乐彩","超级大乐透","七星彩","足彩胜负彩","半全场胜负彩","四场进球彩","排列3","排列5","22选5","36选7"],"lotteryIds":[51,52,23528,23529,10022,11,16,18,33,35,23525,23527]},
	"北京":{"id":1,"lotteryNames":["北京两步彩","北京快乐8","北京PK拾"],"lotteryIds":[20104,20108,20109]},
	"上海":{"id":2,"lotteryNames":["上海天天彩选4","时时乐","华东六省15选5"],"lotteryIds":[10201,10202,21304]},
	"天津":{"id":3,"lotteryNames":["天津体彩6+1","天津风采15选5"],"lotteryIds":[10016,20303]},
	"重庆":{"id":4,"lotteryNames":["重庆时时彩"],"lotteryIds":[10401]},
	"浙江":{"id":13,"lotteryNames":["浙江体彩6+1","浙江体彩20选5","华东六省15选5","浙江体彩31选7"],"lotteryIds":[10019,21302,21304,23533]},
	"广东":{"id":7,"lotteryNames":["南粤风采26选5","南粤风采36选7","深圳风采35选7"],"lotteryIds":[20701,20703,20704]},
	"江苏":{"id":9,"lotteryNames":["江苏体彩7位数","江苏体彩5+1","华东六省15选5"],"lotteryIds":[10013,10014,21304]},
	"福建":{"id":22,"lotteryNames":["华东六省15选5","福建体彩22选5","福建体彩31选7","福建体彩36选7"],"lotteryIds":[21304,22204,22205,22206]},
	"辽宁":{"id":19,"lotteryNames":["辽宁风采35选7"],"lotteryIds":[21902]},
	"河北":{"id":17,"lotteryNames":["燕赵风采20选5"],"lotteryIds":[21703]},
	"河南":{"id":16,"lotteryNames":["中原风采22选5"],"lotteryIds":[21603]},
	"山东":{"id":14,"lotteryNames":["齐鲁风采23选5","11选5"],"lotteryIds":[21401,21406]},
	"山西":{"id":20,"lotteryNames":["三晋风采21选5"],"lotteryIds":[22003]},
	"湖北":{"id":27,"lotteryNames":["楚天风采22选5"],"lotteryIds":[22701]},
	"安徽":{"id":21,"lotteryNames":["华东六省15选5","安徽福彩25选5"],"lotteryIds":[21304,22104]},
	"江西":{"id":30,"lotteryNames":["江西时时彩","华东六省15选5"],"lotteryIds":[13001,21304]},
	"四川":{"id":28,"lotteryNames":["云贵川福彩22选5"],"lotteryIds":[23507]},
	"云南":{"id":23,"lotteryNames":["云贵川福彩22选5"],"lotteryIds":[23507]},
	"贵州":{"id":29,"lotteryNames":["云贵川福彩22选5"],"lotteryIds":[23507]},
	"海南":{"id":24,"lotteryNames":["海南体彩4+1"],"lotteryIds":[10026]},
	"新疆":{"id":26,"lotteryNames":["新疆风采35选7","新疆风采18选7","新疆风采25选7"],"lotteryIds":[22601,22602,22603]},
	"湖南":{"id":31,"lotteryNames":["湖南风采22选5"],"lotteryIds":[23101]},
	"黑龙江":{"id":15,"lotteryNames":["黑龙江体彩6+1","黑龙江福彩P62","龙江风采22选5","龙江风采36选7"],"lotteryIds":[10010,10025,21502,21504]}
})